//Map
//JS -> 객체, 배열 : 많고, 다양하고, 복잡한 프로그램을 만들어 왔죠!!
//그럼에도, 현실세계 반영하기는 좀 많이 어려웠죠....!
//Map, Set 추가적인 자료구조가 등장했습니다.

//Map, set의 목적 : 데이터의 구성, 검색, 사용을 효율적으로 처리 > 기존의 객체
// 또는 배열보다 훨씬더 빠르고 효율적으로 처리하는 게 목적

//(1)  Map
// ~ key / value
// ~key에 어떤 데이터타입(유형)도 다 들어올 수 있다.
// ~Map은 키가 정렬된 순서로 저장되기 때문이다.\
// -기능
// > 검색, 삭제, 제거, 여부 확인

const myMap = new Map(); 
// myMap.set('key', 'value');

//...
//... 항상 get과 set은 페어다
// 맵을 쓰는 이유는 대량의 데이터를 처리하기 위해

// myMap.get('key')
// 반복 ... !! -> method : keys, values, entries 기억